cask_args appdir: "/Applications"
tap "heroku/brew"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
brew "bash-completion"
brew "boost"
brew "cmake"
brew "git"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-libass", "with-libvorbis", "with-libvpx", "with-opus", "with-sdl2", "with-tools", "with-x265"]
brew "gcc"
brew "fftw"
brew "iperf"
brew "lbzip2"
brew "libtiff"
brew "node"
brew "heroku/brew/heroku"
# quicklook plugins
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

cask "postgres"

cask "google-chrome"
cask "sublime-text"
cask "dropbox"
# cask "1password"
# cask "bettertouchtool"

