cask_args appdir: "/Applications"
tap "heroku/brew"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/drivers"
brew "bash-completion"
brew "boost"
brew "cmake"
brew "git"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-libass", "with-libvorbis", "with-libvpx", "with-opus", "with-sdl2", "with-tools", "with-x265"]
brew "gcc"
brew "fftw"
brew "iperf"
brew "lbzip2"
brew "libtiff"
brew "mas" # mac app store
brew "node"
brew "heroku/brew/heroku"


# quicklook plugins
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

cask "postgres"
cask "google-chrome"
cask "sublime-text"
cask "dropbox"
cask "fiji"
cask "istat-menus"
cask "microsoft-office"
cask "private-internet-access"
cask "nvidia-cuda"
cask "launchbar"
cask "transmit"
cask "transmission"
cask "anaconda"
# cask "qt-creator"
# cask "bettertouchtool"

mas "1Password", id: 443987910
mas "DjVu Reader", id: 733144595
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Sip", id: 507257563
mas "Slack", id: 803453959
#mas "Stockfish", id: 801463932
mas "The Unarchiver", id: 425424353